[
    {
        "id": 1,
        "estate_title": "Oceanfront Penthouse",
        "segment_name": "Luxury",
        "description": "Experience the pinnacle of coastal living in this exquisite oceanfront penthouse. Offering breathtaking panoramic views of the sparkling ocean and skyline, this modern retreat features high-end amenities and luxurious finishes throughout. The spacious living area opens onto a private terrace, ideal for entertaining or simply enjoying the sunset. With state-of-the-art facilities and impeccable design, this penthouse epitomizes luxury living at its finest.",
        "price": 3500000,
        "status": "sale",
        "area": "3500 sq ft",
        "location": "Miami Beach, Florida",
        "rating": 4.9,
        "bedRoom": 4,
        "shower": 3,
        "facilities": ["Living Room", "Swimming Pool", "Gourmet Kitchen"],
        "image": "https://i.ibb.co/fFtw3d4/oceanfront-penthouse.jpg"
    },
    {
        "id": 2,
        "estate_title": "Exclusive Beachfront Villa",
        "segment_name": "Luxury",
        "description": "Escape to your own private paradise in this exclusive beachfront villa. Nestled within lush tropical gardens, this stunning property offers direct access to a pristine sandy beach. The villa boasts expansive living spaces, elegantly appointed bedrooms, and a spa-like master suite. Enjoy outdoor dining by the infinity pool or unwind in the oceanfront jacuzzi. This is a rare opportunity to own a slice of luxury in one of the world's most sought-after locations.",
        "price": 5800000,
        "status": "sale",
        "area": "5000 sq ft",
        "location": "Maui, Hawaii",
        "rating": 5.0,
        "bedRoom": 5,
        "shower": 6,
        "facilities": ["Outdoor Dining Area", "Infinity Pool", "Oceanfront Jacuzzi"],
        "image": "https://i.ibb.co/0jKcmQb/Beachfront-Villa.jpg"
    },
    {
        "id": 3,
        "estate_title": "Private Island Retreat",
        "segment_name": "Luxury",
        "description": "Indulge in the ultimate privacy and luxury on your own private island retreat. This exclusive property features a sprawling mansion surrounded by pristine beaches and lush landscapes. The estate includes multiple guest cottages, a private marina, and a full-service spa. With unrivaled amenities and unparalleled natural beauty, this is a once-in-a-lifetime opportunity to own a piece of paradise.",
        "price": 12000000,
        "status": "sale",
        "area": "10 acres",
        "location": "Caribbean",
        "rating": 4.8,
        "bedRoom": 8,
        "shower": 10,
        "facilities": ["Private Marina", "Spa Facilities", "Helipad"],
        "image": "https://i.ibb.co/LN2sv7b/private-island.jpg"
    },
    {
        "id": 4,
        "estate_title": "Seaside Mansion",
        "segment_name": "Luxury",
        "description": "Discover unparalleled luxury in this magnificent seaside mansion. Situated on a prime waterfront location, this sprawling estate features stunning architecture and lavish interiors. Enjoy sweeping views of the ocean from every room and relax in the infinity pool overlooking the beach. With multiple entertainment areas, a home theater, and a private wine cellar, this mansion offers the epitome of coastal living.",
        "price": 7800000,
        "status": "sale",
        "area": "8000 sq ft",
        "location": "Malibu, California",
        "rating": 4.7,
        "bedRoom": 10,
        "shower": 12,
        "facilities": ["Infinity Pool", "Home Theater", "Private Wine Cellar"],
        "image": "https://i.ibb.co/0cFstST/seaside-mansion.jpg"
    },
    {
        "id": 5,
        "estate_title": "Luxury Ski Chalet",
        "segment_name": "Luxury",
        "description": "Escape to the mountains in this exceptional luxury ski chalet. Nestled among snow-capped peaks, this elegant retreat offers ski-in/ski-out access and breathtaking alpine views. The chalet features spacious living areas with vaulted ceilings, a gourmet kitchen, and a private hot tub on the terrace. After a day on the slopes, unwind by the fireplace or pamper yourself in the spa-like bathrooms.",
        "price": 4500000,
        "status": "sale",
        "area": "4000 sq ft",
        "location": "Aspen, Colorado",
        "rating": 4.9,
        "bedRoom": 5,
        "shower": 2,
        "facilities": ["Ski-in/Ski-out Access", "Private Hot Tub", "Fireplace"],
        "image": "https://i.ibb.co/5T4TkgT/ski-chalet.jpg"
    },
    {
        "id": 6,
        "estate_title": "Tropical Resort",
        "segment_name": "Luxury",
        "description": "Immerse yourself in luxury at this tropical resort nestled in a secluded paradise. This expansive property features multiple villas surrounded by lush gardens, a private beach, and a championship golf course. Indulge in world-class dining, spa treatments, and water sports without leaving the comfort of your private retreat. Whether seeking relaxation or adventure, this resort offers an unrivaled experience.",
        "price": 15000000,
        "status": "sale",
        "area": "20 acres",
        "location": "Bora Bora, French Polynesia",
        "rating": 5.0,
        "bedRoom": 12,
        "shower": 5,
        "facilities": ["Private Beach", "Championship Golf Course", "Spa and Wellness Center"],
        "image": "https://i.ibb.co/JrznS09/Tropical-Resort.jpg"
    },
    {
        "id": 7,
        "estate_title": "Historic Castle",
        "segment_name": "Luxury",
        "description": "Step back in time with this extraordinary historic castle, meticulously restored to its former glory. This castle boasts opulent interiors, grand reception halls, and beautifully landscaped gardens. Enjoy breathtaking views from the tower and explore the secret passages and ancient artifacts within. Live like royalty in this one-of-a-kind residence steeped in history.",
        "price": 10000000,
        "status": "sale",
        "area": "15,000 sq ft",
        "location": "Loire Valley, France",
        "rating": 4.8,
        "bedRoom": 10,
        "shower": 5,
        "facilities": ["Tower with Views", "Landscaped Gardens", "Historic Artifacts"],
        "image": "https://i.ibb.co/JH5YBT2/Historic-Castle.jpg"
    },
    {
        "id": 8,
        "estate_title": "Private Mountain Retreat",
        "segment_name": "Luxury",
        "description": "Experience serenity in this private mountain retreat surrounded by untouched wilderness. This exclusive property offers unparalleled seclusion and natural beauty. The rustic yet luxurious lodge features handcrafted woodwork, stone fireplaces, and expansive outdoor decks. Enjoy hiking, fishing, and wildlife viewing right outside your doorstep in this mountain paradise.",
        "price": 3200000,
        "status": "sale",
        "area": "6000 sq ft",
        "location": "Montana, USA",
        "rating": 4.6,
        "bedRoom": 3,
        "shower": 2,
        "facilities": ["Stone Fireplaces", "Outdoor Decks", "Hiking Trails"],
        "image": "https://i.ibb.co/Wt8G8Hb/Private-Mountain-Retreat.jpg"
    },
    {
        "id": 9,
        "estate_title": "Contemporary Urban Oasis",
        "segment_name": "Luxury",
        "description": "Embrace modern luxury in this sleek urban oasis located in the heart of a vibrant city. This contemporary masterpiece features floor-to-ceiling windows, designer interiors, and a private rooftop terrace with skyline views. Entertain guests in the gourmet kitchen or unwind in the spa-like bathrooms with soaking tubs. Enjoy the convenience of city living without sacrificing style or comfort.",
        "price": 5000000,
        "status": "sale",
        "area": "3000 sq ft",
        "location": "New York City, USA",
        "rating": 4.9,
        "bedRoom": 5,
        "shower": 3,
        "facilities": ["Rooftop Terrace", "Designer Interiors", "City Views"],
        "image": "https://i.ibb.co/Pjbz9gt/Contemporary-Urban-Oasis.jpg"
    }
]